# CantPlaceATOnDuctError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CantPlaceATOnDuctError Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The air terminal cannot be placed in an elevation or section view unless it is attached to a duct.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantPlaceATOnDuctError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantPlaceATOnDuctError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantPlaceATOnDuctError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace